[
{"Name": "Christmas pie", "url": "https://www.bbcgoodfood.com/recipes/2793/christmas-pie", "Description": "Combine a few key Christmas flavours here to make a pie that both children and adults will adore", "Author": "Mary Cadogan", "Ingredients": ["2 tbsp olive oil", "knob butter", "1 onion, finely chopped", "500g sausagemeat or skinned sausages", "grated zest of 1 lemon", "100g fresh white breadcrumbs", "85g ready-to-eat dried apricots, chopped", "50g chestnut, canned or vacuum-packed, chopped", "2 tsp chopped fresh or 1tsp dried thyme", "100g cranberries, fresh or frozen", "500g boneless, skinless chicken breasts", "500g pack ready-made shortcrust pastry", "beaten egg, to glaze"], "Method": ["Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil and the butter in a frying pan, then add the onion and fry for 5 mins until softened. Cool slightly. Tip the sausagemeat, lemon zest, breadcrumbs, apricots, chestnuts and thyme into a bowl. Add the onion and cranberries, and mix everything together with your hands, adding plenty of pepper and a little salt.", "Cut each chicken breast into three fillets lengthwise and season all over with salt and pepper. Heat the remaining oil in the frying pan, and fry the chicken fillets quickly until browned, about 6-8 mins.", "Roll out two-thirds of the pastry to line a 20-23cm springform or deep loose-based tart tin. Press in half the sausage mix and spread to level. Then add the chicken pieces in one layer and cover with the rest of the sausage. Press down lightly.", "Roll out the remaining pastry. Brush the edges of the pastry with beaten egg and cover with the pastry lid. Pinch the edges to seal, then trim. Brush the top of the pie with egg, then roll out the trimmings to make holly leaf shapes and berries. Decorate the pie and brush again with egg.", "Set the tin on a baking sheet and bake for 50-60 mins, then cool in the tin for 15 mins. Remove and leave to cool completely. Serve with a winter salad and pickles."]},
{"Name": "Simmer-&-stir Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/1160/simmerandstir-christmas-cake", "Description": "An easy-to-make alternative to traditional Christmas cakes which requires no beating", "Author": "Mary Cadogan", "Ingredients": ["175g butter, chopped", "200g dark muscovado sugar", "750g luxury mixed dried fruit (one that includes mixed peel and glacé cherries)", "finely grated zest and juice of 1 orange", "finely grated zest of 1 lemon", "100ml/3½ fl oz cherry brandy or brandy plus 4tbsp more", "85g macadamia nut", "3 large eggs, lightly beaten", "85g ground almond", "200g plain flour", "½ tsp baking powder", "1 tsp ground mixed spice", "1 tsp ground cinnamon", "¼ tsp ground allspice"], "Method": ["Put the butter, sugar, fruit, zests, juice and 100ml/3½fl oz brandy in a large pan. Bring slowly to the boil, stirring until the butter has melted. Reduce the heat and bubble for 10 minutes, stirring occasionally.", "Remove the pan from the heat and leave to cool for 30 minutes.", "Meanwhile, preheat the oven to 150C/gas 2/ fan 130C and line a 20cm round cake tin. Toast the nuts in a dry frying pan, tossing them until evenly browned, or in the oven for 8-10 minutes - keep an eye on them as they burn easily. When they are cool, chop roughly. Stir the eggs, nuts and ground almonds into the fruit mixture and mix well. Sift the flour, baking powder and spices into the pan. Stir in gently, until there are no traces of flour left.", "Spoon the mixture into the tin and smooth it down evenly - you will find this is easiest with the back of a metal spoon which has been dipped into boiling water.", "Bake for 45 minutes, then turn down the heat to 140C/gas 1/ fan120C and cook for a further 1-1¼ hours (about a further 1¾ hours if you have a gas oven) until the cake is dark golden in appearance and firm to the touch. Cover the top of the cake with foil if it starts to darken too much. To check the cake is done, insert a fine skewer into the centre - if it comes out clean, the cake is cooked.", "Make holes all over the warm cake with a fine skewer and spoon the extra 4tbsp brandy over the holes until it has all soaked in. Leave the cake to cool in the tin. When it's cold, remove it from the tin, peel off the lining paper, then wrap first in baking parchment and then in foil. The cake will keep in a cupboard for up to three months or you can freeze it for six months."]},
{"Name": "Christmas cupcakes", "url": "https://www.bbcgoodfood.com/recipes/72622/christmas-cupcakes", "Description": "These beautiful and classy little cakes make lovely gifts, and kids will enjoy decorating them too", "Author": "Sara Buenfeld", "Ingredients": ["200g dark muscovado sugar", "175g butter, chopped", "700g luxury mixed dried fruit", "50g glacé cherries", "2 tsp grated fresh root ginger", "zest and juice 1 orange", "100ml dark rum, brandy or orange juice", "85g/3oz pecannuts, roughly chopped", "3 large eggs, beaten", "85g ground almond", "200g plain flour", "½ tsp baking powder", "1 tsp mixed spice", "1 tsp cinnamon", "400g pack ready-rolled marzipan(we used Dr Oetker)", "4 tbsp warm apricotjam or shredless marmalade", "500g pack fondant icingsugar", "icing sugar, for dusting", "6 gold and 6 silver muffincases", "6 gold and 6 silver sugared almonds", "snowflake sprinkles"], "Method": ["Tip the sugar, butter, dried fruit, whole cherries, ginger, orange zest and juice into a large pan. Pour over the rum, brandy or juice, then put on the heat and slowly bring to the boil, stirring frequently to melt the butter. Reduce the heat and bubble gently, uncovered for 10 mins, stirring every now and again to make sure the mixture doesn’t catch on the bottom of the pan. Set aside for 30 mins to cool.", "Stir the nuts, eggs and ground almonds into the fruit, then sift in the flour, baking powder and spices. Stir everything together gently but thoroughly. Your batter is ready.", "Heat oven to 150C/130C fan/gas 2. Scoop the cake mix into 12 deep muffin cases (an ice-cream scoop works well), then level tops with a spoon dipped in hot water. Bake for 35-45 mins until golden and just firm to touch. A skewer inserted should come out clean. Cool on a wire rack.", "Unravel the marzipan onto a work surface lightly dusted with icing sugar. Stamp out 12 rounds, 6cm across. Brush the cake tops with apricot jam, top with a marzipan round and press down lightly.", "Make up the fondant icing to a spreading consistency, then swirl on top of each cupcake. Decorate with sugared almonds and snowflakes, then leave to set. Will keep in a tin for 3 weeks."]},
{"Name": "Christmas buns", "url": "https://www.bbcgoodfood.com/recipes/1803633/christmas-buns", "Description": "Paul Hollywood's fruit rolls can be made ahead then heated up before adding a glossy glaze and citrus icing", "Author": "Paul Hollywood", "Ingredients": ["500g strong white flour, plus extra for dusting", "7g sachet fast-action dried yeast", "300ml milk", "40g unsalted butter, softened at room temperature", "1 egg", "vegetable oil, for greasing", "25g unsalted butter, melted", "75g soft brown sugar", "2 tsp ground cinnamon", "100g dried cranberries", "100g chopped dried apricot", "50g caster sugar", "zest 1 lemon", "200g icing sugar"], "Method": ["Put the flour and 1 tsp salt into a large bowl. Make a well in the centre and add the yeast. Meanwhile, warm the milk and butter in a pan until the butter melts and the mixture is lukewarm. Add the milk mixture and egg to the flour mixture and stir until the contents come together as a soft dough (add extra flour if you need to).", "Tip the dough onto a well-floured surface. Knead for 5 mins, adding more flour if necessary, until the dough is smooth, elastic and no longer sticky.", "Lightly oil a bowl with the vegetable oil. Place the dough in the bowl and turn until covered in oil. Cover the bowl with cling film and set aside in a warm place for 1 hr or until doubled in size. Lightly grease a baking sheet and set aside.", "For the filling, knock the dough back to its original size and turn out onto a lightly floured surface. Roll it into a 1cm-thick rectangle. Brush all over with the melted butter, then sprinkle over the sugar, cinnamon and fruit.", "Roll up the dough into a tight cylinder, cut into 9 x 4cm slices and position on the prepared baking sheet, leaving a little space between. Cover with a tea towel and set aside to rise for 30 mins.", "Heat oven to 190C/170C fan/gas 5. Bake the buns for 20-25 mins or until risen and golden brown. Meanwhile, melt the glaze sugar with 4 tbsp water until syrupy.", "Remove from oven and glaze. Set aside to cool on a wire rack. Once cool, mix the zest and icing sugar with about 2 tbsp water to drizzle over the buns. Serve."]},
{"Name": "Clementine & prosecco jellies", "url": "https://www.bbcgoodfood.com/recipes/896661/clementine-and-prosecco-jellies", "Description": "I thought these were ok but a few of my guests loved them. Definitely test your juice before adding gelatine because some fruit might need w little extra sugar. They were a good get ahead dessert and simple to make so I may make them again.", "Author": "James Martin", "Ingredients": ["7 leaves gelatine", "600ml clementine juice(from about 14 clementines)", "300ml prosecco", "1 sheet edible goldleaf (available from squires-shop.com)"], "Method": ["Put the gelatine sheets into a bowl of cold water to soften for a few mins. Put 100ml clementine juice into a small pan and gently heat. When the gelatine feels soft and the juice is just simmering, remove the juice from the heat and squeeze out any excess water from the gelatine sheets. Drop the sheets into the hot juice and swirl to melt. Make sure there are no visible lumps of gelatine before you move onto the next stage.", "Stir the hot juice into the rest of the juice with the prosecco, then transfer to a jug. Pour between 6 small glasses. Sit the jellies in a small tray or dish, cover with a sheet of cling film and chill for at least 4 hrs (or up to 48 hrs) until set.", "When ready to serve, use a pair of tweezers to carefully put a piece of gold leaf on the surface of each jelly."]},
{"Name": "Make-ahead gravy", "url": "https://www.bbcgoodfood.com/recipes/2743668/makeahead-gravy", "Description": "Prepare this traditional accompaniment to roast dinner before the main event - use off-cuts and plenty of onion to add flavour and colour", "Author": "Good Food", "Ingredients": ["1kg chicken wing, halved with kitchen scissors", "the turkeyneck, if you have it, cut into pieces", "3 large carrots, chopped into chunks", "2 onions, unpeeled and chopped", "3 celerysticks, chopped", "small handful thymesprigs", "2 tbsp sunflower oil", "2 tsp golden caster sugar", "1 tbsp tomato purée", "4 tbsp plain flour", "4 tbsp balsamic vinegar", "1 vegetable stockcube"], "Method": ["Heat oven to 220C/200C fan/gas 7. Tip the chicken wings into a roomy roasting tin with the turkey neck (if using), carrots, onions, celery and thyme. Scatter over the sugar, toss in the oil and roast for 50 mins until brown and lightly charred.", "Get the kettle on. Put the roasting tin on a low heat, stir in the tomato purée and flour, and cook until sticky. Splash in the balsamic vinegar, then pour over 1.5 litres water to just cover all the ingredients. Bring to a simmer. Crumble in the stock cube and use a potato masher to mash all the ingredients together to release the flavour.", "Simmer everything for 20 mins until you have a tasty thickened gravy, then strain it through a sieve, pushing down hard on all the mushy veg. Cool and chill for up to 3 days, or freeze for up to 3 months.", "Heat the gravy to serve, adding roasting juices from your turkey, if you like."]},
{"Name": "Full English potato cake", "url": "https://www.bbcgoodfood.com/recipes/2762668/full-english-potato-cake", "Description": "Take time to start the day in style with a special breakfast of giant hash browns with bacon, eggs and tomato", "Author": "Good Food", "Ingredients": ["1½ kg potato, diced into 1cm chunks", "4 tbsp olive oil, plus extra for drizzling", "6 spring onions, finely chopped", "2 thymesprigs, leaves stripped, plus 1 sprig left whole", "25g butter, melted, plus extra for greasing", "12 rashers streaky bacon", "3 large plum tomatoes, halved", "cracked black pepper", "6 medium eggs", "buttered toast, to serve", "brown and tomato sauce, tea and orange juice, to serve (optional)"], "Method": ["Bring a big saucepan of salted water to the boil. Tip in the potatoes and simmer until almost tender, about 20 mins. Drain really well and steam dry for a few mins. Return to the pan and toss with 2 tbsp of the oil, the spring onions, thyme leaves and lots of seasoning.", "Grease your largest baking tray with some melted butter and press the potatoes into it. Put a baking sheet on top and gently press down to squash the spuds into a cake. Cover and chill until ready for breakfast.", "Heat oven to 220C/200C fan/gas 7. Drizzle the melted butter and remaining oil over the potato cake and bake for 30 mins until golden.", "Add the bacon in a few piles and bake for another 15 mins. Dot over the tomato halves and the remaining thyme sprig, sprinkle with plenty of pepper, then crack the eggs among the gaps and bake for 5-8 mins, depending how you like your eggs.", "To serve, cut the potato cake into portions and pile onto 6 plates, along with the eggs, bacon, tomatoes and some buttered toast. Serve with brown and tomato sauce, tea and orange juice, if you like."]},
{"Name": "Very berry trifle", "url": "https://www.bbcgoodfood.com/recipes/2807667/very-berry-trifle-", "Description": "Layers of mascarpone, custard, cherry conserve, mixed berries, Madeira cake and sherry - who doesn't love a trifle?", "Author": "Sarah Cook", "Ingredients": ["500g pack frozen mixed berry, we used summer berry mix, defrosted", "150g red cherryjam", "300-350g madeira cake, cut into roughly 3cm cubes", "500ml tub custard", "250g tub mascarpone", "5 tbsp caster sugar", "400ml double cream", "3 tbsp sherry", "berries, grated chocolateor rose petals, to decorate"], "Method": ["Mix the berries and cherry jam together, and spoon into your trifle bowl. Scatter over the Madeira cake and push down a little into the berries.", "Put the custard, mascarpone and 3 tbsp sugar in a bowl together and beat until smooth, then dollop all over the trifle. Put the double cream, remaining 2 tbsp sugar and sherry in a bowl and beat until soft peaks form. Cling film both the trifle bowl and cream and chill until ready to serve. You can do this up to 24 hours in advance.", "To serve, spoon the sherry cream all over the trifle, then scatter with your favourite decoration."]},
{"Name": "Turkey cacciatore with a twist", "url": "https://www.bbcgoodfood.com/recipes/1826693/turkey-cacciatore-with-a-twist", "Description": "This tasty Italian cheese and tomato bake is a fab way to use up leftover meat and a true family favourite", "Author": "Sarah Cook", "Ingredients": ["2 small or 1 large onion, chopped", "2 garlic cloves, crushed", "3 tbsp olive oil", "2 tsp dried oregano", "3 x cans chopped tomatoesor cherry tomatoes", "1 tbsp sugar", "little splash vinegar", "about 500g leftover turkey, shredded into chunks", "1 x 125g balls mozzarella", "2 good handfuls fresh breadcrumbs"], "Method": ["Fry the onion and garlic in the oil until softened. Add the tomatoes and sugar, a little splash of vinegar and some seasoning, then simmer for 20 mins until really thick. Stir in the turkey and transfer to a baking dish. Heat oven to 220C/200C fan/gas 7.", "Tear over the mozzarella in chunks, then scatter over the breadcrumbs with a bit more ground pepper. Bake for 20 mins until turkey is piping hot through, and the top is golden and bubbling. Eat with mash, jackets, rice or pasta"]},
{"Name": "Eggnog trifle", "url": "https://www.bbcgoodfood.com/recipes/eggnog-trifle", "Description": "nice recipe, definitely try this at Christmas. :-) Christmas day party in Berkshire", "Author": "Cassie Best", "Ingredients": ["375g caster sugar", "3 large eggs, separated", "3 tbsp cornflour", "800ml double cream", "250ml full-fat milk", "165ml brandy, marsala or sherry (or a mixture)", "1 vanilla pod", "35-40 cream-filled profiteroles(without chocolate) - shop bought are fine or make your own (see goes well with)", "1 large orange, zested, plus 1 tbsp juice", "50g crunchy amaretti biscuits", "4 medium clementines, peeled and sliced into thick rounds"], "Method": ["For the custard, whisk 150g sugar, the egg yolks and cornflour in a bowl until pale and smooth. Pour 300ml cream, the milk and 65ml of the alcohol into a saucepan. Split the vanilla pod, scrape out the seeds and add to the cream with the pod. Heat until steaming but not boiling, then pour the hot liquid onto the yolks, whisking as you go. Strain the liquid through a sieve into a clean saucepan and discard the vanilla pod. Return to a low-medium heat and whisk for about 10 mins until very thick. If you get lumps, simply whisk them out. Pour the custard into a jug and cover with cling film directly on the surface. Chill for 11 /2 hrs.", "Arrange half the profiteroles in the base of a 2-litre trifle bowl. Spoon 2 tbsp of the remaining alcohol over the profiteroles along with the orange juice, then crumble over the biscuits. Trickle the custard over the profiterole base. Arrange the remaining profiteroles on top of the custard, working around the edges first, then filling the centre. Arrange the clementine slices around the edge of the bowl, tucking them around the profiteroles", "Whisk the remaining alcohol, 500ml cream, 50g sugar and the orange zest until holding soft peaks. Spread the mixture over the profiteroles, right to the edge of the bowl, then return to the fridge until you’re ready to serve. ", "For the meringue, put the egg whites, the remaining 175g sugar, 1 tbsp water and a good pinch of salt in a heatproof bowl over a pan of simmering water, making sure the bowl doesn’t touch the water. Whisk until thick and leaving a prominent trail from the beaters – this will take about 4 mins. Take the bowl off the heat and continue whisking for another 3 mins until cooled slightly and very stiff.", "Spoon the meringue onto the trifle, creating peaks and troughs with the back of a spoon. Use a blowtorch to scorch the meringue if you have one (but don’t hold it too close to the bowl if it’s made of delicate glass!). Best served straight away, but will keep for a day in the fridge."]},
{"Name": "Ham hock & pistachio roll", "url": "https://www.bbcgoodfood.com/recipes/ham-hock-pistachio-roll", "Description": "I made this for Christmas starter 2 yrs ago and it was brilliant. I made it early and froze it and it was still excellent. Will be making it again this year.", "Author": "Barney Desmazery", "Ingredients": ["2 smoked ham hock(about 3kg in total)", "2 carrots, roughly chopped", "1 onion, roughly chopped", "1 leektop, if you have it, roughly chopped (optional)", "2 celery sticks, roughly chopped", "2 bay leaves", "1 thyme sprig", "2 cloves", "1 allspiceberry", "1 tbsp apple cider vinegar, plus a splash", "small pack parsley, leaves chopped, stalks reserved", "80g shelled and toasted pistachio", "2 Granny Smithsapples", "1 shallot, thinly sliced into rings", "2 tbsp apple cider vinegar", "40g bag pork scratchings, lightly crushed", "1 bag of watercress", "2 tbsp English mustard", "2 tbsp apple cider vinegar", "4 tbsp extra virgin rapeseed oil, plus extra for brushing (optional)"], "Method": ["To make the roll, put the ham hocks in a large pan and add all the ingredients, except the chopped parsley (do add the stalks) and pistachios. Cover with cold water, bring to the boil and simmer gently for 3-4 hrs until the meat is very tender.", "Remove the hocks from the liquid, reserving 100ml (save the rest to make a split pea or chunky vegetable soup), and leave them until just cool enough to handle – the hotter the ham, the easier it is to shred. If you have a pair of clean washing-up or food preparation gloves, it's easier to handle the hocks while they are hot. Take the meat off the bone and shred into another bowl, discarding any skin, large bits of fat, gristle or cartilage. Add the pistachios, chopped parsley and 100ml ham stock in with the ham, and add a drizzle more vinegar. Squish everything through your fingers to mix it a bit more. ", "Lay overlapping pieces of cling film on a clean work surface the size of an A3 piece of paper. Pile the mixture along the bottom length of the cling film, leaving about 10cm free on each side. Roll the ham in the cling film into a large, tight sausage shape, piercing with a skewer once or twice to release any air, then put in the fridge overnight. Can be made up to four days ahead.", "To make the dressing, tip the mustard into a bowl and slowly whisk in the vinegar, then the oil, to make an emulsion. Tip into a squeezy bottle if you have one. Using a small melon baller, scoop out balls of the apples, then tip into a bowl with the vinegar, add the shallot rings and leave for a few mins to pickle.", "To serve, carve the ham roll on the diagonal, still in the cling film, into slices about 2cm thick. Peel off the cling film, put the slices on plates and brush with a little rapeseed oil if you want to make it shiny. Build a thin line of watercress along the other side of the plate and arrange three apple balls and some shallot rings along the watercress, then scatter with chunks of scratchings. Dot the plate with blobs of dressing and serve the rest on the side."]},
{"Name": "Cardamom whirls", "url": "https://www.bbcgoodfood.com/recipes/147609/cardamom-whirls", "Description": "These beautifully spiced Swedish-style pastries are fantastic with a cup of coffee", "Author": "Mary Cadogan", "Ingredients": ["500g strong white bread flour, plus extra for dusting", "85g butter, cut into small pieces", "1 x 7g sachet easy-blend dried yeast", "50g golden caster sugar", "1 tsp ground cardamom", "250ml milk", "175g white marzipan, grated", "2 tsp ground cardamom", "50g butter, melted", "1 egg, lightly beaten", "10 sugar cubes, broken into small pieces"], "Method": ["Tip the flour and ½ tsp salt into a food processor fitted with a dough blade. Add the butter and process until the mixture resembles fine breadcrumbs. Stir in the yeast, then the sugar and cardamom.", "Warm the milk until it is hand hot, then add to the dry mix to form a soft dough. Process the dough for 2 mins, then leave in the machine to rise for about 1 hr until it springs back when pressed with a finger. Process the dough briefly in the machine, then tip out onto a lightly floured surface.", "Heat oven to 220C/200C fan/gas 7. Line 2 baking sheets with baking paper. For the filling, mix the marzipan with the cardamom and butter. Roll out sthe dough to a 50 x 20cm rectangle. Spread the filling over the dough to within 1cm of the edges. Roll up the dough from one long edge. Cut into 20 slices, about 3cm thick, then transfer to the baking sheets, cut sides up. Cover with a tea towel and leave to rise for 30-40 mins until well risen.", "Brush the whirls with beaten egg and sprinkle with broken sugar. Bake for 12-15 mins until risen and golden. Best eaten freshly baked, or freeze on the day of baking for up to a month."]},
{"Name": "Florentine biscuits", "url": "https://www.bbcgoodfood.com/recipes/florentine-biscuits", "Description": "Be prepared to make extra topping. If double receipe definitely triple topping\nHalved cherries look great", "Author": "Cassie Best", "Ingredients": ["175g slightly salted butter, softened", "85g golden caster sugar", "½ tsp vanilla extract", "225g plain flour, plus extra for dusting", "¼ tsp ground cinnamon", "50g butter", "50g light brown soft sugar", "50g golden syrup", "½ tsp salt", "50g plain flour", "75g glacé cherries, chopped", "75g flaked almonds", "150g dark chocolate, chopped"], "Method": ["To make the biscuits, put the butter, sugar and vanilla in a bowl and beat with an electric whisk until creamy. Add the flour and cinnamon, and combine with a spatula to make a soft dough. Form into a ball, wrap in cling film and chill for at least 1 hr.", "In a saucepan, melt the butter, sugar, golden syrup and salt. Remove from the heat and whisk in the flour, then stir in the cherries and almonds. Set aside to cool and firm up a little. Heat oven to 180C/160C fan/gas 4 and line a baking sheet with parchment.", "Tip the dough onto a floured work surface and roll out to the thickness of a £1 coin. Using a 6cm fluted cookie cutter, stamp out as many circles as you can, then scrunch up the trimmings, re -roll and stamp out some more. Transfer to the baking sheet, and spoon some of the Florentine mixture onto each biscuit until it’s all used up. Bake on the middle shelf for 12-15 mins until the biscuits are golden and the topping has melted. Leave to cool on the sheet for at least 15 mins.", "While the biscuits cool, melt the chocolate in a small heatproof bowl suspended over a pan of gently simmering water, or in short bursts in the microwave. Stir every 30 secs or so to ensure it doesn’t burn. Dip each biscuit about a third of the way into the chocolate, then return to the sheet to set. You may need to spoon the chocolate over the final few. Will keep for up to four days in a sealed container."]},
{"Name": "Peppered mackerel & pink pickled onion salad", "url": "https://www.bbcgoodfood.com/recipes/peppered-mackerel-pink-pickled-onion-salad", "Description": "Made this as a starter over the Christmas period and it was absolutely gorgeous. Wouldn't change the recipe one bit.", "Author": "Sophie Godwin", "Ingredients": ["240g pack peppered smoked mackerel, torn into pieces", "100g bag watercress", "250g pack ready-cooked beetroot", "100g bag honey-roasted mixed nuts", "1 small red onion, very thinly sliced", "3 tbsp sherry vinegar", "pinch of sugar", "4 tbsp extra virgin olive oil"], "Method": ["Mix together the onion, vinegar, sugar and a pinch of salt. Leave to pickle while you dice the beetroot and roughly chop the nuts.", "Divide the watercress and smoked mackerel between six plates. Scatter over the beetroot and nuts, then top with a cluster of the pickled onions. Whisk the oil into the pickling vinegar, then drizzle the dressing around the outside of each plate."]},
{"Name": "Beetroot blinis with smoked salmon", "url": "https://www.bbcgoodfood.com/recipes/beetroot-blinis-smoked-salmon", "Description": "Top light, homemade blinis with cream cheese and smoked fish for a pretty and elegant canapé - a perfect party nibble", "Author": "Miriam Nice", "Ingredients": ["1 cooked beetroot", "170g pot Greek yogurt", "2 eggs", "½ tsp bicarbonate of soda", "140g self-raising flour", "cream cheese, to serve", "smoked salmontrimmings, to serve", "sprigs of dill, to serve"], "Method": ["To make the blini batter, blend the cooked beetroot and Greek yogurt with a stick blender until smooth. Whisk in the eggs, bicarbonate of soda and self-raising flour.", "Drop teaspoonfuls of the mixture into a hot non-stick pan. Turn over when small bubbles start to form on the surface of each, then cook for about 30 secs and transfer to a wire rack. Repeat until all the batter is used up. Can be made a day ahead and kept in an airtight container.", "Spread each blini with a little cream cheese and season with salt and black pepper. Top with smoked salmon trimmings and sprigs of dill."]},
{"Name": "Leftover turkey casserole", "url": "https://www.bbcgoodfood.com/recipes/1826709/leftover-turkey-casserole-", "Description": "This one pot stew uses up all your roast dinner leftovers in one go and has a great honey mustard tang", "Author": "Sarah Cook", "Ingredients": ["2 onions, finely chopped", "1 eating apple, cored and chopped", "2 tbsp olive oil", "1 tsp dried sage, or 5 sage leaves, chopped", "2 tbsp plain flour", "300ml vegetable or chicken stock", "2 tbsp wholegrain mustard", "2 tbsp runny honey", "400g-500g leftover turkey, shredded", "about 350g leftover roasted vegetables like roast potatoes, parsnips, celeriacs and carrots, chunkily diced"], "Method": ["Fry the onion and apple in the oil until softened in a casserole or deep pan. Stir in the sage for 1 min, then stir in the flour. Gradually stir in the stock followed by the mustard and honey.", "Bring up to a simmer and stir in the turkey and roast veg. Cover and gently simmer for 15 mins until turkey is piping hot. Season and eat with mash or jacket potatoes."]},
{"Name": "Festive spice", "url": "https://www.bbcgoodfood.com/recipes/festive-spice", "Description": null, "Author": "Miriam Nice", "Ingredients": ["40g ground cinnamon", "30g ground coriander", "2 tsp nutmeg", "1 tsp ground ginger", "¼ tsp ground cloves", "1 orange, zested", "1 lemon, zested", "2 tsp light brown sugar", "1 tsp sea salt"], "Method": ["Combine all ingredients in a bowl and mix. ", "Now you can use the spice mix in other recipes, including our ", ", ", ", ", ", or a fluffy ", " for frosting your cakes with."]},
{"Name": "Healthy roast turkey crown", "url": "https://www.bbcgoodfood.com/recipes/healthy-roast-turkey-crown", "Description": null, "Author": "Barney Desmazery", "Ingredients": ["2kg turkeycrown on the bone", "3 oranges, 1 cut into wedges, ½ sliced, 1 ½ juiced", "1 tbsp runny honey, plus extra for drizzling", "handful thyme sprigs, leaves picked from one, two left whole, plus sprigs to serve (optional)", "1 tsp soy sauce", "2 bay leaves", "500g carrots, peeled and cut into long batons", "500g parsnips, peeled and cut into long batons"], "Method": ["Take your turkey crown out of the fridge 1-2 hrs before you want to cook it. Heat oven to 200C/180C fan/gas 6. Cut 4 slices from one of the oranges. Juice the rest of it along with another of the oranges. In a small bowl, stir the orange juice together with the honey and the picked thyme leaves, the soy sauce and a good grinding of black pepper. ", "Loosen the skin over the turkey breast. Place two slices of orange, a bay leaf and thyme sprig under the skin, on both sides of the breast, then spoon in some of the juice mix and smooth the skin back over. Tip the orange wedges into a roomy roasting tin with the carrots and parsnips. Nestle the crown amongst the vegetables and oranges. Drizzle over about a third of the remaining orange juice mix and roast everything in the oven for 30 mins. Remove, give the veg a stir and drizzle over another third of the juice mix, then return to the oven and do that again one more time, roasting the turkey for a total of 1hr 30 mins (covering with foil halfway through if it begins to colour too much).", "Remove the turkey from the roasting tin and place on a board covered with foil, then turn the oven up to 220C/200C fan/gas 8. Toss the veg in a drizzle of honey and put the tin back in the oven to caramelise the veg for 25-30 mins, leaving the turkey crown to rest. Serve the crown on a platter surrounded by the glazed roots, orange wedges and extra thyme sprigs, if you like. Remove the sticky skin from the breast before ", " to serve as a side."]},
{"Name": "Sausage nut stuffing cake", "url": "https://www.bbcgoodfood.com/recipes/2572/sausage-nut-stuffing-cake", "Description": "This basic stuffing recipe is really versatile, you can shape into small balls and cook around the bird or make one fabulous looking cake", "Author": "Mary Cadogan", "Ingredients": ["2 tbsp olive oil", "25g butter", "3 shallots, finely chopped", "2 sticks celery, finely chopped", "100g white breadcrumbs", "500g good-quality sausagemeat", "50g roughly chopped walnuts, plus extra to serve", "grated zest 1 small orange", "1 tbsp chopped sage leaves, or 1 tsp dried", "1 egg, beaten", "8 rashers rindless streaky bacon", "handful chopped parsley, to serve"], "Method": ["Heat oven to 200C/fan 180C/gas 6. Have ready an 18-20cm springform cake tin. Heat the oil and butter and gently fry the shallots and celery for 5 mins without colouring them. Tip into a bowl and add the breadcrumbs, sausagemeat, walnuts, orange zest and sage. Add plenty of pepper and a little salt, if using, and mix together with your hands. Add the egg, then mix well.", "Arrange the bacon slices in the tin, leaving 5cm strip on the base, then lay them up around the sides of the tin and let the excess hang over the edge. Carefully fill the tin with the stuffing mix, levelling it on top. Fold the bacon over the top of the stuffing, gathering and twisting the ends loosely in the centre. Scatter over the remaining walnuts, pressing them in slightly.", "Set the tin on a baking sheet to catch any juices that escape, then bake for 40-45 mins until the top is golden. Cool in the tin for 10 mins, then remove onto a serving plate and scatter with parsley. Cut into wedges to serve."]},
{"Name": "Braised chestnuts, apples & Brussels sprouts", "url": "https://www.bbcgoodfood.com/recipes/braised-chestnuts-apples-brussels-sprouts", "Description": "This is a huge hit with the kids, and they often ask for it when are having sausages. I have to say I was sceptical about the apples with the sprouts but it works", "Author": "Raymond Blanc", "Ingredients": ["50g unsalted butter", "400g raw peeled chestnut(or frozen raw peeled chestnuts, defrosted)", "1 celery stick, cut into 1cm/½ in slices", "1 Braeburn apple(about 100g/4oz), skin on, cored and cut into 8 segments", "100ml water(or light chicken stock)", "2 tsp golden caster sugar", "1 tbsp lemon juice", "400g Brussels sprouts"], "Method": ["Heat the butter in a medium saucepan on a low heat. Add the chestnuts, celery and apple, and cook gently for 4 mins. Pour in the stock, bring to the boil and season with 1 tsp fine sea salt, 2 pinches freshly ground white pepper, the sugar and lemon juice. Cover and cook on a low heat (so that the bubbles are just breaking the surface) for 20-25 mins until soft and melting.", "Meanwhile, blanch the sprouts in boiling salted water for 6 mins, then drain well. Add the sprouts to the chestnut pan, sizzle for 5 mins, then tip into a serving dish."]},
{"Name": "Gingerbread jumpers", "url": "https://www.bbcgoodfood.com/recipes/gingerbread-jumpers", "Description": "Cover these cute gingerbread biscuits with icing and sprinkles in Christmas jumper patterns for a fantastically festive bake", "Author": "Cassie Best", "Ingredients": ["175g dark muscovado sugar", "85g golden syrup", "100g slightly salted butter", "350g plain flour, plus extra for dusting", "1 tsp bicarbonate of soda", "1 tbsp ground ginger", "1 tsp ground cinnamon", "1 egg, beaten", "500g fondant icing sugar", "food colouringpaste in various colours, or use coloured icing tubes (and you won’t need the fondant icing sugar)", "sugar sprinkles(optional)"], "Method": ["Put the sugar, golden syrup and butter in a saucepan. Bring to a simmer, then bubble for 1-2 mins, stirring until well combined. Set aside to cool for 10 mins.", "Tip the flour, bicarbonate of soda and spices into a large bowl. Add the warm syrup mixture and the egg, stir to bring everything together, then gently knead in the bowl until smooth and streak-free. The dough will feel a little soft now, but will firm up once cooled. Wrap the dough in cling film and chill for at least 30 mins.", "Remove the dough from the fridge and and leave at room temperature until softened. Heat oven to 200C/180C fan/gas 6 and line two baking trays with baking parchment.", "Working with half the dough at a time (keeping the remaining dough well wrapped), roll out to the thickness of a £1 coin, keeping the dough in a rough rectangle shape. Cut the dough into long strips, roughly 8cm wide, then cut each strip into ‘jumpers’ (see step-by-step). Cut out a V-neck for the collar and trim slim triangular pieces from either side to create sleeves (see step-by-step). Continue rolling and shaping the dough until you have about 20 jumper shapes. Arrange over the trays and bake for 8 mins until a few shades darker and puffed up a little. Cool on the trays for 5 mins, then transfer to a wire rack to cool completely. Un-iced, the biscuits will keep in a sealed container for up to 2 weeks.", "For ‘flooded’ biscuits, mix 100g fondant icing sugar with enough water to make a thick but pipeable icing – it should hold its shape when piped. Transfer the icing to a piping bag fitted with a fine round nozzle and pipe a line around the edge of each biscuit. If you have any icing left, tip it back into a bowl and add the remaining icing sugar, then add enough water to make an icing a little looser than the first batch, but not too runny. Divide the icing between as many bowls as the number of colours you’d like to use, then add a tiny bit of colouring to each and mix well until you have a vivid colour.", "If you have disposable piping bags, transfer the icings to different bags and secure the open ends (see tip).", "To pipe your jumpers using the 'flooding' method, pipe the runnier icing onto the biscuit, then use a cocktail stick to encourage it to fill every corner up to the piped border. Once dry, you can add details like fluffy collars and cuffs or spots and stripes with the thicker icing.", "To pipe your jumpers with a cable knit effect, pipe lines of coloured icing (we used white) vertically across the jumper. Use a toothpick to drag up and down through the icing to create a wave effect.", "Finish off with sugar sprinkles if desired - we used mini gingerbread men, snowflakes, white ‘mimosa’ balls and gold polka dot sprinkles (see tip)."]},
{"Name": "Coffee lover's kit", "url": "https://www.bbcgoodfood.com/recipes/1013641/coffee-lovers-kit", "Description": "Ginger biscuits wrapped up with a tin of coffee and a pair or espresso cups make a very cute Christmas gift set", "Author": "Good Food", "Ingredients": ["140g unsalted butter", "100g dark muscovado sugar", "4 tbsp golden syrup", "300g plain flour, plus extra for dusting", "1 tsp bicarbonate of soda", "2 tsp ground ginger", "3 balls stem ginger, finely chopped", "airtight box, bag or jar", "gift box, ribbonand label", "2 espressocups (optional)", "pack or tin of ground coffee"], "Method": ["Heat oven to 170C/150C fan/gas 3-4. Line 2 baking trays with baking parchment. Melt butter, sugar and syrup in a pan, stirring until the sugar melts. Take off the heat. Sieve the flour, bicarb and ground ginger into a bowl, pour in the wet ingredients and add the stem ginger. Stir to make a stiff dough.", "Roll the warm dough out on a surface dusted with flour until about ½cm thick. Stamp out biscuits using a cutter, lift onto the baking trays and cook for 10 mins or until golden. Cool completely, then lift off parchment. ", "Pack the biscuits in an airtight box, bag or jar, then put in a gift box with the cups and coffee and tie with a ribbon."]},
{"Name": "Fennel & poppy seed cracker wreath", "url": "https://www.bbcgoodfood.com/recipes/1826691/fennel-and-poppy-seed-cracker-wreath", "Description": "Arrange savoury biscuits in a pretty circle around your chosen cheese for a decorative centrepiece and alternative cheeseboard", "Author": "Sarah Cook", "Ingredients": ["300g plain flour, plus extra for rolling", "2 tsp baking powder", "85g butter, diced", "2 tsp fennel seed, plus extra to sprinkle", "2 tsp poppy seed, plus extra to sprinkle", "splash of milk"], "Method": ["Heat oven to 180C/160C fan/gas 4. Line one baking sheet with parchment. Place the flour, baking powder, butter, fennel and poppy seeds with ½ tsp salt in a food processor, then whizz for a minute until the butter is completely mixed with the flour. Add 100ml water and pulse until the mixture comes together to a firm dough that’s not sticky – you may need another tbsp or so of water, if it still feels.", "Roll out dough on a lightly floured surface as thinly as you can. Stamp out lots of different sized circles using a selection of round and fluted biscuit cutters of 4cm, 5cm and 6cm diameter. Brush a little milk over the surface of the biscuits, and prick all over with a fork. Start to arrange in a circle on the baking sheet, overlapping each other. If you want to serve a cheese in the centre, check that it will fit. Scatter over a few more fennel and poppy seeds and bake for 15 - 20 mins until the biscuits feel dry and sandy with a slightly golden colour around the edges - they may still feel soft but will harden up when cooling. Cool on the baking sheet. Serve with cheese & chutney. Will keep in an airtight container for up to 2 weeks."]},
{"Name": "Smoked cheese in blankets", "url": "https://www.bbcgoodfood.com/recipes/smoked-cheese-blankets", "Description": "Used the round Austrian smoked cheese that looks like a sausage from Sainsburys. Cut into 4 lengthways then into 3 across to make 12 pieces. For bite size pieces cut into 4 both ways. Tip.....wrap the pancetta lengthways first, then around the cheese this will stop the cheese from oozing out of the ends. Great little Christmas treats, good for canapes or as part of a sharing starter board. Make the cranberry and chestnut falafels to go onto the starter board also on BBC good food. To complete make cream cheese and smoked salmon blinis, I used the ready made blinis from Sainsburys. Makes a nice sharing board for a starter.", "Author": "Gizzi Erskine", "Ingredients": ["18-24 thin rashers smoked pancetta", "150g Bavarian smoked cheese, trimmed and cut into 24 pieces", "a few rosemarysprigs"], "Method": ["Heat oven to 200C/180 fan/gas 6. Carefully wrap the pancetta around the cheese pieces (you may not need a full slice of pancetta for each piece of cheese, depending on the size). Can be done two days ahead and kept covered in the fridge.", "Put the rosemary sprigs on a baking tray and place the cheese in blankets on top. Roast in the oven for 15 mins until golden and crispy. Serve immediately but be careful, as they will be molten hot inside."]},
{"Name": "Seared venison with sprout & apple slaw", "url": "https://www.bbcgoodfood.com/recipes/seared-venison-sprout-apple-slaw", "Description": null, "Author": "Rosie Birkett", "Ingredients": ["400g venisonloin", "2 tbsp rapeseed oil", "1 tbsp Worcestershire sauce", "2 juniper berries, crushed", "2 rosemary sprigs, leaves picked and chopped", "½ tsp finoor balsamic vinegar", "200g Brussels sprouts, finely shredded", "½ orange, juiced and zested", "1 tbsp rapeseed oil, plus extra for frying", "1 green apple", "bunch of parsley, finely chopped", "½ pomegranate, seeds only", "crème fraîchemixed with horseradish and 1 tbsp pumpkin seeds, toasted (optional), to serve"], "Method": ["Mix the marinade ingredients together and marinate the venison for a couple of hours in the fridge. Heat oven to 200C/180C fan/gas 6.", "For the slaw, put the sprouts in a bowl and pour over the orange juice. Season with salt and drizzle over some rapeseed oil. Using your hands, scrunch the sprouts in the dressing for a few minutes to tenderise them. Grate in the apple, allowing the juice to also dress the sprouts, then toss with the remaining ingredients. Check for seasoning and add more rapeseed oil if you think it needs it. It wants to be perfectly dressed, rather than greasy.", "Heat a little rapeseed oil in a heavy-bottomed skillet or frying pan until smoking hot, then add the venison and cook for 2-3 mins until a caramelised crust has formed on the underside. Flip it over and cook for another couple of mins, making sure it's sealed all over. Place on a baking sheet and put in the oven for 5-6 mins, depending on how rare you like it. Remove from the oven and allow to rest for at least 5 mins, then slice. Spread some crème fraîche and horseradish over each plate and top with then venison. Serve the slaw on the side and scatter over the seeds, if you like."]},
{"Name": "Pear, chocolate & marzipan strudel", "url": "https://www.bbcgoodfood.com/recipes/pear-chocolate-marzipan-strudel", "Description": "Prepare ahead and freeze this rich filo pastry pud, then cook from frozen for the perfect fuss-free seasonal dessert", "Author": "Good Food", "Ingredients": ["85g butter, melted, plus a little extra", "5 pears, peeled, cored and chopped", "4 tbsp light muscovado sugar, plus extra for sprinkling", "1 tbsp Disaronno(optional)", "100g ginger biscuit, crushed", "1 tsp ground cinnamon", "100g dark chocolate, broken into chunks", "100g marzipan, chopped into small pieces", "250g pack filo pastry(at least 6 sheets)", "icing sugar and cream, to serve"], "Method": ["Melt a knob of butter in a large frying pan, add the pears and 1 tbsp sugar, and cook for 5 mins. Tip into a bowl and leave to cool. Then add the Disaronno (if using), biscuits, cinnamon, chocolate, marzipan, and 2 tbsp sugar and mix well.", "Line a tray with baking parchment. Lay a sheet of filo on it, brush with melted butter and sprinkle with a little sugar. Top with a second sheet of filo and keep going until you’ve used all the pastry. Pile the filling down one of the long sides of the pastry, then roll it up to form a sausage. Make sure it is seam-side down, then tuck the ends under tightly. Roll up in the parchment, wrap tightly in foil and freeze.", "Heat oven to 200C/180C fan/gas 6. Put a tray in the oven to heat. Unwrap the strudel and place, seam-side down and still on its parchment, onto the tray. Brush with melted butter and sprinkle over 1 tbsp sugar. Bake for 35-40 mins, or until golden and crisp. Leave to cool for 10 mins, then dust with icing sugar."]},
{"Name": "Cinnamon butter rum", "url": "https://www.bbcgoodfood.com/recipes/cinnamon-butter-rum", "Description": "A brilliant, festive and comforting tipple. Added a bit more sugar and butter though, to make it extra decadent ;)", "Author": "Miriam Nice", "Ingredients": ["25g butter", "2 tbsp golden caster sugar", "2 small cinnamon sticks", "200ml spiced rum"], "Method": ["Gently heat the butter, golden caster sugar and cinnamon sticks in a saucepan until the butter has melted and the sugar has dissolved.", "Stir in the spiced rum, then pour into four small heatproof glasses to serve."]},
{"Name": "Glazed baby veg", "url": "https://www.bbcgoodfood.com/recipes/8264/glazed-baby-veg", "Description": "A simple way to cook veg to serve alongside your favourite main", "Author": "Jane Hornby", "Ingredients": ["150g baby carrots", "150g turnips", "1 tbsp butter", "1 tsp caster sugar"], "Method": ["Boil carrots and turnips for 3 mins until starting to soften then cool completely under cold running water. Can be blanched up to a day ahead.", "When you’re ready to serve, heat butter and caster sugar in a pan until the butter melts, add the veg and seasoning, then toss for 2 mins until just tender and glossy."]},
{"Name": "Ballotine of pheasant", "url": "https://www.bbcgoodfood.com/recipes/ballotine-pheasant", "Description": "We talk you through the technique of preparing poultry to create an impressive, easy-to-carve roast - ours is a boned and stuffed pheasant", "Author": "Barney Desmazery", "Ingredients": ["2 oven-ready pheasants", "25g soft butter", "12 rashers smoked streaky bacon", "1 onion, finely chopped", "2 tsp butter", "50g prune, soaked in 3 tbsp brandy", "400g sausagemeat, from 6 whole sausages", "2 tbsp thyme leaves", "large handful parsley, roughly chopped", "25g pistachio", "25g fresh breadcrumb"], "Method": ["First, make the stuffing. Fry the onion in the butter for 5-10 mins until softened, then leave to cool completely. Thoroughly mix the remaining ingredients in a large bowl, including the cooled onions.", "If the wings are attached, cut at the first joint (on most butchered birds they will have been removed). Find the wishbone between the neck and the breast, then use a sharp knife to scrape away the flesh around it. Gently pull it out, trying to keep it as one, cut it away and discard.", "Place the pheasant, breast side down, on the board. Using a sharp boning knife, see tip, left, cut through the skin to the backbone along the length of the bird.", "Working down the length of the pheasant, slowly run your knife down against the ribcage, keeping close to the bone and scraping the flesh away from both. Twist out the thigh joints when you get to them.", "Very carefully cut away the main carcass. This is where the skin is at its thinnest, so cut carefully as you don’t want to nip or pierce the skin.", "Open the bird out like a book and lay it, skin-side down, on the board.", "Season the bird’s flesh with salt and pepper then arrange half of the stuffing down the middle of each of the birds in a sausage shape.", "Re-form the bird by lifting the sides up and around the stuffing. After you’ve done one, repeat with the other pheasant.", "Wrap each pheasant tightly and neatly with bacon so that the bacon goes all the way round the bird and joins on the underside.", "Using butcher’s string, tie the pheasant at regular intervals around the width. Then tie it once around the length to hold the stuffing in.", "Finally, tie the legs together. The pheasant can be prepared to this stage and chilled up to a day ahead.", "Heat oven to 200C/ 180C/gas 6. Transfer the pheasant to a roasting tin. Roast for 45-50 mins, basting regularly with the juices from the tin. Finally, cover with foil and rest for about 15 mins. Serve in thick slices with the juices from the pan."]},
{"Name": "Cheeseboard sticks", "url": "https://www.bbcgoodfood.com/recipes/cheeseboard-sticks", "Description": "Create a canapé out of a classic cheeseboard, then thread on to skewers with quince paste and grapes", "Author": "Good Food", "Ingredients": ["6 grapes, a mix of red and green", "75g soft goat's cheese(we used an ash-covered one)", "50g blue cheese(we used Stilton)", "75g Comté or cheddar", "75g membrillo(quince paste)"], "Method": ["Slice the grapes in half, then cut the cheeses and quince paste into 12 pieces.", "Thread a grape half onto a mini skewer, followed by a piece of each of the cheeses and a piece of quince paste. Repeat, then arrange the sticks on a serving platter."]},
{"Name": "Really good roast potatoes", "url": "https://www.bbcgoodfood.com/recipes/really-good-roast-potatoes", "Description": "Boil, fluff then crisp up in goose fat and oil for perfect roast potatoes - if you're vegetarian, sunflower oil works just as well", "Author": "Sara Buenfeld", "Ingredients": ["3kg King Edward potatoes, cut into large chunks", "175g goose fat", "4 tbsp sunflower oil(or 8 tbsp if you’re not using goose fat)", "flaky salt"], "Method": ["Boil the potatoes for 5 mins in salted water until the outside of the potatoes starts to soften. Drain well, return to the pan and shake to fluff up the outsides – alternatively, you can scratch them with a fork. (This process will make them crispier.)", "Heat oven to 180C/160C fan/gas 4. Put the goose fat (if using) and oil in a large shallow roasting tin and heat for 8-10 mins until the goose fat has melted and the mixture is really hot. Remove from the oven, carefully tip in the potatoes and stir well to coat them in the fat. Spread them out as much as the space allows and roast underneath the turkey for 45 mins, turning frequently and adjusting the positions so that they brown evenly.", "When the turkey comes out of the oven, turn up the heat to 220C/200C fan/gas 7, season the potatoes with the flaky salt and roast for another 30 mins, turning halfway through the cooking time, until beautifully golden."]},
{"Name": "Partridge in cider with apples & celery", "url": "https://www.bbcgoodfood.com/recipes/partridge-cider-apples-celery", "Description": "Serve a partridge as an individual portion for one in this seasonal stew with smoked bacon, Bramley apples, thyme and sage", "Author": "Tom Kerridge", "Ingredients": ["2 tbsp olive oil", "2 partridge, ready-prepared by your butcher", "plain flour, for dusting", "150g pack smoked baconlardons", "1 onion, finely diced", "2 celerysticks, cut into 4cm pieces", "2 Bramley apples, cut into chunks", "2 tbsp thyme leaves", "2 tbsp finely chopped sage", "250ml scrumpy cider", "250ml good chicken stock"], "Method": ["Heat oven to 150C/130C fan/gas 2. Place a large frying pan over a medium heat and pour in 1 tbsp of the oil. Dust the partridges in the flour and fry until evenly browned all over. Remove from the pan and drain on a piece of kitchen paper.", "Put a large casserole dish on the heat. Pour in the remaining oil, add the lardons and cook until the fat has rendered out and the lardons are crisp. Add the onion and celery to the pan and sweat down until soft. Stir in the apples to soften a little. Add the thyme, sage and the partridges, then pour over the cider and chicken stock and bring to the boil. Cover and transfer to the oven for 25 mins or until the thigh meat is cooked through and will come away from the bone, and the sauce has reduced and thickened. Remove from the oven and serve with the Smoked butter mash (see 'Goes well with')."]},
{"Name": "Whisky cream & jelly with toasted oat crumble & tea sorbet", "url": "https://www.bbcgoodfood.com/recipes/whisky-cream-jelly-toasted-oat-crumble-tea-sorbet", "Description": "This make ahead, grown-up dessert layers up sweet cream, boozy jelly and crunchy oats - finished with earl grey sorbet", "Author": "Tom Kerridge", "Ingredients": ["500ml black Earl Grey tea", "150g golden caster sugar", "150g liquid glucose", "100ml double cream", "1 egg", "25g caster sugar", "1 tbsp whisky", "1 leaf gelatine, soaked in cold water for 5 mins", "100ml whisky", "25g golden caster sugar", "1 leaf gelatine, soaked in cold water for 5 mins", "1 tbsp cold butter", "1 tbsp plain flour", "1 tbsp caster sugar", "1 tbsp medium oats", "½ tsp clear honey"], "Method": ["To make the sorbet, bring the tea, sugar and liquid glucose to the boil in a pan. Make sure the sugar and glucose have dissolved, then strain into a jug and leave to cool completely. Pour into an ice cream machine and churn until frozen, then transfer to a freezer-proof container and freeze until needed.", "To make the cream layer, pour the cream into a heavy-based pan and bring to the boil. In a bowl, whisk together the egg and sugar, then pour over the cream and whisk until combined. Rinse out the cream pan and pour in the mixture. Return to the heat and cook gently, whisking all the time, until it reaches 88C – you’ll need a digital thermometer to test this. When it reaches this temperature, it will have thickened and the egg will be cooked. Pass the mix through a fine sieve into a clean bowl. Pour in the whisky, then squeeze any excess water out of the soaked gelatine and add to the bowl. Stir until all the gelatine has melted, then leave to cool a little. Pour into 4 small or 2 large glass dishes, leaving enough room for the jelly, and place in the fridge for at least 4 hours until set.", "Make the jelly when the cream layer is almost set, put the whisky and sugar in a small pan and bring to the boil, making sure the sugar has dissolved. Remove from the heat, squeeze out any excess water from the gelatine, add to the pan and stir until melted. Pass the jelly through a fine sieve into a jug and place to one side to cool completely.", "Once the cream layer has set, remove from the fridge and pour over the cooled jelly. If you have some left, don’t worry, just leave it to set in the fridge and eat it on its own. Return to the fridge and chill until the jelly has set. Can be made up to 2 days in advance; once set, cover with cling film and store in the fridge.", "Heat oven to 180C/160C fan/gas 4. To make the crumble, rub the butter into the flour until it resembles crumbs, then mix in the remaining ingredients. Tip onto a baking tray and bake for 15-20 mins or until golden brown. You will need to stir it a few times to ensure it cooks evenly. Remove from the oven and leave to cool. When cool, bash to a semi-fine crumble. Store in an airtight container until ready to serve.", "Remove the set creams from the fridge and sprinkle over a generous layer of the crumble mix. Serve topped with a scoop of tea sorbet. Perfect with a shot of whisky!"]},
{"Name": "Crunchy confit roast potatoes", "url": "https://www.bbcgoodfood.com/recipes/crunchy-confit-roast-potatoes", "Description": "How is this confit? It isn't - it's roasted potatoes.", "Author": "Chelsie Collins", "Ingredients": ["2kg floury potatoes(we used Maris Piper), cut into chunks", "200g duck fator goose fat (reserved from the confit turkey - see 'goes well with' opposite)", "flaky sea salt"], "Method": ["On Christmas Eve, put the potatoes in a large saucepan and cover with cold salted water. Bring to the boil, reduce the heat to a simmer and cook for 2-3 mins until slightly tender. Drain and give them a good shake in the colander. Tip into a large roasting tin lined with baking parchment and leave, uncovered, in the fridge overnight.", "When your turkey crown goes in, put the duck fat in your largest roasting tin and heat in the oven. After 10 mins, transfer your cold potatoes to the hot duck fat – you should hear them sizzle as they hit the tin. Toss to coat in the fat and season well with flaky sea salt, then spread them in a single layer so they crisp up better. Roast for about 1 hr 30 mins, turning a few times, to evenly brown. Serve immediately."]},
{"Name": "Buttered baby carrots", "url": "https://www.bbcgoodfood.com/recipes/buttered-baby-carrots", "Description": null, "Author": "Miriam Nice", "Ingredients": ["500g baby carrots", "1 tbsp butter"], "Method": ["Wash and peel the baby carrots, keeping the green tops intact. Put them in a medium saucepan and half-fill with salted water. Bring to the boil and cook for 4 mins or until just tender. Drain, then transfer to a serving dish, season and stir in the butter."]},
{"Name": "Persian pilaf & roasted root loaves", "url": "https://www.bbcgoodfood.com/recipes/persian-pilaf-roasted-root-loaves", "Description": "Why is this called 'Persian'? Throwing pistachios and saffron into any dish does NOT make it Persian. If anything, it's closer to Moroccan flavours than Persian.", "Author": "Sarah Cook", "Ingredients": ["200g carrots, peeled and cut into 1-2cm chunks", "200g sweet potatoes, peeled and diced like the carrots", "200g parsnips, peeled and diced like the carrots too", "3 tbsp olive oil, plus extra for greasing", "1 red onion, finely chopped", "pinch of saffron", "1 tsp ground cinnamon", "1 tsp ground cumin", "1 tsp ground coriander", "2 tsp cumin seeds", "225g paella rice", "550-600ml vegetable stock", "100g dried apricots, diced", "400g can chickpeas, drained - optional (good for bulking the mixture if you want to feed another mouth)", "150g shelled pistachios", "2 large eggs, beaten with a fork", "handful corianderleaves", "500g tub Greek yogurt, to serve", "couscousand green salad, to serve", "400g can chopped tomatoes", "500g carton passata", "2 tbsp honey", "2 tbsp red wine vinegar", "2 tbsp pomegranate molasses", "1 tbsp harissa paste", "500g chantenay carrots, scrubbed", "500g baby beetroots", "250-300g small shallots, peeled and halved", "2 tbsp olive oil", "1 tbsp cumin seeds", "3 tbsp pomegranate molasses", "zest and juice 1 orange", "150g pomegranate seeds"], "Method": ["Heat oven to 180C/160C fan/gas 4. Toss the carrot chunks, sweet potato and parsnip with 2 tbsp of the oil on a baking sheet. Roast in the oven until golden and tender – about 20-25 mins.", "Meanwhile put the last tbsp of oil in a deep frying or sauté pan with the onion, and cook gently for around 8-10 mins to soften. Stir in the saffron and rice, then stir in the stock. Bring to the boil, then reduce the heat so the rice is gently simmering and cook, stirring occasionally for 25 mins or until the rice is tender and stock just absorbed – like a paella. Stir in the cinnamon, coriander and both types of cumin, plus the chopped apricots and take off the heat. Leave to cool with the roasted veg while you get the rest of the ingredients and tins ready.", "Roughly chop the pistachios. Grease 8 small loaf tins with a little oil, then cut long strips of baking parchment to line the base and ends of each tin – with overhangs to help you lift out the loaves when they’re done.", "Scrape the cooled rice into a big mixing bowl and stir through the beaten eggs with salt and pepper. Scatter over chickpeas if using, plus the roasted veg and 100g of the pistachios and fold through. Divide the mixture between the loaf tins, and use your hands to neatly round the tops. ", "Make the sauce by combining all the ingredients with a little salt and pepper in a saucepan. Simmer for 20 mins until thickened and rich. ", "An hour before you want to serve, heat the oven to 200C/180C fan/gas 6. For the roasted pomegranate roots, mix the carrots, beetroot, shallots and oil in a big roasting tin with some seasoning. Roast on the top shelf for 15 mins, with an empty tray heating on the bottom shelf.", "Stir the cumin seeds, pomegranate molasses, orange juice and zest through the veg and put back on the top shelf. Sit the Persian rice loaves on the preheated tray, and bake for another 30 mins together. Finally, stir the pomegranate seeds through the veg, and swap the shelves – so the loaves sit on the top, for a last 5 mins of cooking. Meanwhile gently reheat the sauce.", "Carefully lift the loaves out of their tins onto a platter, and scatter with the last 50g of chopped pistachios plus some coriander leaves. Let guests help themselves, sitting the Persian loaves in a pool of tangy tomato sauce – with spoonfuls of the roasted pomegranate roots, couscous, salad leaves and Greek yogurt alongside."]},
{"Name": "Mulled rosé wine", "url": "https://www.bbcgoodfood.com/recipes/mulled-rose-wine", "Description": "I made this and it was delicious. I did change it up a bit though because I was going for more of a fall flavor.\nAdded 3 cinnamon sticks to the spice mix.\nAn extra ball of ginger.\nExtra Star of Anise.\nExtra splash of crema de cassis (just because I love that stuff).\nAnd the biggest change, I did 1 apple instead of 1/4 grapefruit.\nIt created the perfect warm fall beverage. After adding the crema de cassis I poured the entire concoction, spices and all, into my slow cooker on low so it would stay warm for the evening. I just dumped the entire mix in there and after sitting in the wine, the apples made a really delicious treat.", "Author": "Miriam Nice", "Ingredients": ["750ml rosé wine", "1 star anise", "1 ball of stem ginger, sliced", "½ tsp black peppercorns", "5 allspiceberries", "¼ pink grapefruit, sliced", "2 tbsp crème de cassis"], "Method": ["Pour the rosé wine into a large saucepan with the star anise, stem ginger, black peppercorns, allspice berries and pink grapefruit. Bring to a simmer over a medium heat then stir in the crème de cassis, strain into a jug then serve in heatproof glasses or cups."]},
{"Name": "Celeriac & comté fritters", "url": "https://www.bbcgoodfood.com/recipes/celeriac-comte-fritters", "Description": null, "Author": "Rosie Birkett", "Ingredients": ["4 quail's eggs", "200g celeriac, peeled and coarsely grated", "1 green apple, grated", "1 tbsp tarragonor chervil, roughly chopped", "6 sage leaves, chopped", "100g comté cheese, grated", "1 tbsp pumpkin seeds", "2 eggs, separated", "1 tsp Dijon mustard", "pinch of chilli flakes", "1 tbsp rapeseed oil, plus extra for frying", "1 tbsp butter", "bunch of parsley, leaves picked", "½ red onion", "white wine vinegar", "pinch of celery salt"], "Method": ["Heat oven to 200C/180C fan/gas 6. Put the quail's eggs in a bowl of warm tap water to get them used to the change in temperature. Then bring about an inch of water to the boil in a saucepan and prepare a bowl with some iced water. Gently lower the quail's eggs into the boiling water and boil for 2 mins, then drop them into the iced water. Leave them in there until chilled. Carefully peel and set aside.", "Toss the celeriac, apple, herbs and cheese together with the pumpkin seeds, chilli flakes and season. Combine the egg yolk with the Dijon and stir into the celeriac mixture. ", " the egg white to stiff peaks and fold into the celeriac fritter mix.", "Heat a little rapeseed oil and butter in a non-stick frying pan. Put two dessertspoonfuls of fritter into the hot fat and fry for 1 min or until a caramelised crust has formed. Turn carefully and cook for a further 2 mins. Place on a lined baking sheet and bake for 5 mins. Remove from the oven and allow to settle on the sheet for a couple of mins. Dress the parsley and red onion with a little of the vinegar and rapeseed oil. Divide between plates and top with the quail's eggs and celery salt. Serve with the parsley salad."]},
{"Name": "Mulled cider", "url": "https://www.bbcgoodfood.com/recipes/mulled-cider", "Description": "nice to me re if u have any tips!!", "Author": "Good Food", "Ingredients": ["1½ l dry cider", "7 tbsp Calvados", "400ml apple juice", "75g dark brown sugar", "zest 1 orange, pared into strips", "4 whole cloves", "2 cinnamon sticks, broken in half", "1 tbsp allspiceberries"], "Method": ["Pour the cider, Calvados, apple juice and sugar into a large saucepan, and gently heat to mull.", "Add the orange zest and spices, bring to a simmer, then turn down and keep on a low heat for 20-30 mins. Ladle into glass mugs to serve."]},
{"Name": "Tuscan sausage, kale & ciabatta stuffing", "url": "https://www.bbcgoodfood.com/recipes/tuscan-sausage-kale-ciabatta-stuffing", "Description": null, "Author": "BBC Good Food team", "Ingredients": ["270g loaf ciabatta, torn into chunks", "350ml milk", "4 tbsp olive oil", "2 onions, finely chopped", "1 heaped tsp fennel seeds", "pinch of chilli flakes(optional)", "4 garlic cloves, grated", "3 large handfuls cavolo neroor kale, de-stalked and shredded", "8 x good-quality pork sausages, meat removed from their skins", "50g pine nuts, toasted", "85g grated parmesan", "handful flat-leaf parsley, chopped", "large rosemary sprig, finely chopped", "1 lemon, zested", "1 egg, beaten"], "Method": ["Soak all but one handful of the bread chunks in the milk and set aside. Heat the oil in a large non-stick pan and cook the onions with the fennel and chilli flakes (if using) for 10 mins until softened. Add the garlic and the cavelo nero or kale and cook for 5 mins until softened, adding more oil if needed. Leave to cool.", "Tip the onion mixture and the remaining ingredients (aside from the handful of bread) into a large bowl, season generously and use your hands to scrunch everything together really well. Scatter the stuffing into a shallow roasting tin or baking dish. ", ". Top the stuffing with the remaining torn bread. To cook, heat oven to 220C/200C fan/gas 7 and bake for 30-35 mins until the top is crispy."]},
{"Name": "Chilli cranberry sauce", "url": "https://www.bbcgoodfood.com/recipes/69618/chilli-cranberry-sauce", "Description": "A tiny hint of chilli lifts this cranberry sauce to a whole new tastebud-tingling level", "Author": "Good Food", "Ingredients": ["100g golden caster sugar", "175ml white wine", "½ mild red chilli, chopped, seeds left in", "300g frozen or fresh cranberries"], "Method": ["Gently heat sugar and wine in a saucepan. Once sugar has dissolved, bring to the boil.", "Tip in the chilli and cranberries, return to the boil, then turn the heat down and simmer for about 10 mins until the berries have popped but not completely collapsed. Take off the heat. The sauce will continue to cook with the heat from the pan, then thicken as it cools."]},
{"Name": "Potted ham", "url": "https://www.bbcgoodfood.com/recipes/851634/potted-ham", "Description": "This simple starter is a great way to use up leftover ham and you can freeze it ahead", "Author": "Barney Desmazery", "Ingredients": ["250g pack unsalted butter", "500g cooked ham", "bunch curly parsley,leaves picked and finely chopped", "small pinch ground cloves", "pinch yellow mustard seeds", "1 tbsp cider vinegar", "rustic country bread toast, cornichons, chutney or red onion marmalade to serve"], "Method": ["Gently melt the butter in a small pan and leave it to settle. Slowly pour the clear yellow fat from the melted butter into a small bowl or jug, leaving the milky liquid in the pan. Discard the milky bit. Pull apart and shred the ham as finely as possible into stringy strips – use a knife to help if you need to.", "Mix the ham with the parsley, spices, vinegar, two-thirds of the butter and a little crunchy sea salt. Divide between 8 small ramekins or pots. Press down and flatten the surface with your fingers, then spoon or pour over the remaining butter. Chill until butter is solid, then wrap in cling film. Will freeze for up to 3 months.", "To serve, defrost the pots overnight in the fridge if frozen. Serve with toast, cornichons and chutney, or dip pots briefly in a bowl of hot water and turn the potted ham out onto plates first."]},
{"Name": "Roast turkey with sage & onion butter and Marsala gravy", "url": "https://www.bbcgoodfood.com/recipes/995640/roast-turkey-with-sage-and-onion-butter-and-marsal", "Description": "This is a really tasty and easy roast recipe that won't let you down on the big day", "Author": "Good Food", "Ingredients": ["7kg/15lb 4oz fresh turkey", "2 onions, halved", "1 lemon, quartered", "75g soft butter", "3 tbsp finely chopped fresh sage", "2 tbsp plain flour", "200ml marsalawine or Madeira", "400-500ml/14fl oz-18fl oz hot chicken stock", "1 tbsp cranberry jelly"], "Method": ["Heat oven to 170C/150C fan/gas 3-4 and place the turkey in a large roasting tin. Tuck 3 of the onion halves and the lemon quarters into the cavity and season. Cover with foil, make sure there’s plenty of space between the turkey and foil for the air to circulate and seal the edges tightly so that no steam escapes. Roast for 4 hrs.", "Meanwhile, finely chop the remaining onion half, and mix with the butter and sage. Take the turkey out of the oven and raise the temp to 200C/180C fan/ gas 6. Brush the sage and onion butter all over the turkey and return to the oven, uncovered, for 45 mins until crisp and dark golden. If you’re making the roasties, then start them in the oven when the turkey goes back in, uncovered.", "Transfer the turkey to a warm serving plate, cover loosely with foil and leave to rest for 30 mins. Tip the juices out of the pan into a bowl, leave for a moment to settle, then scoop the buttery oil from the surface into a separate bowl. Spoon 2 tbsp of this oil back into the tin and return to the heat.", "Stir the flour into the tin using a wooden spoon, scraping the residue off the bottom of the tin as you go. Cook for 2 mins, then stir in the Marsala or Madeira and bring to the boil. Make the reserved turkey juices up to 500ml using hot chicken stock and pour into the tin. Bring to the boil and simmer for a few mins, then add cranberry jelly. Keep warm until ready to serve."]},
{"Name": "Game terrine", "url": "https://www.bbcgoodfood.com/recipes/2656636/game-terrine", "Description": "John Torode shows how to prepare classic coarse set terrine with duck and mixed game of your choice", "Author": "John Torode", "Ingredients": ["1 boneless duck breast, skin on (about 175g/6oz)", "300g smoked streaky bacon", "300g boneless, skinless chicken thigh", "500g chicken liver, trimmed", "140g mixed game, such as skinless pheasant breast, pigeon or additional duck", "½ tbsp chopped garlic", "1 tsp ground allspice", "1 tsp juniper berry, finely ground", "1 tbsp chopped parsley", "2 tbsp Armagnacor any other brandy", "100ml dry white wine", "50ml chicken stock", "a little butter, for greasing", "toasts and cornichons, to serve"], "Method": ["Carefully cut the duck skin from the duck breast, then very finely chop the skin. Reserve 12 bacon rashers for lining the tin. Cut all the meat and remaining bacon into 1cm pieces, keeping the different meats separate (Step 1). Put all the best bits to one side.", "Reserve the chopped bacon and, from the best bits, reserve 100g chopped chicken, 250g chicken livers, half the mixed game, half the duck and half the duck skin.", "Put all the remaining meat and duck skin into a food processor (include any fattier pieces) and blend to a mince. Transfer to a bowl and add the garlic, allspice, juniper berries, parsley, Armagnac or brandy, wine and stock. Mix in the reserved chopped meat and marinate in the fridge overnight.", "Heat oven to 180C/160C fan/gas 4. Grease a 1.5-litre loaf tin or terrine mould with butter. Lightly stretch the reserved bacon rashers (Step 2) and use most of them to line the tin or mould, overlapping slightly and leaving plenty of overhang at the top (Step 3). Pack the meat mixture into the tin (Step 4), then fold over the bacon overhang and lay the reserved rashers on top.", "Cover the terrine with baking parchment, then cover tightly with foil. Put a folded tea towel in a roasting tin and set the terrine on top (Step 5). Pour enough hot water into the roasting tin to come just below the rim of the terrine tin.", "Put in the oven, then reduce heat to 160C/140C fan/gas 3 and bake for 1½ hrs. Take from the oven and leave to cool for 1 hr in the water bath, then remove and leave to cool completely.", "Once cool, cut a strip of foil or card to fit the top of the tin, put it on top of the terrine and weigh it down with a few heavy cans (Step 6). Chill overnight.", "Carefully remove the terrine from the tin, wipe off all the jelly and serve in slices with the toasts and cornichons."]},
{"Name": "Chorizo & prawn skewers", "url": "https://www.bbcgoodfood.com/recipes/chorizo-prawn-skewers", "Description": "Create a simple, crowd-pleasing canapé by spearing Spanish sausage and harissa shellfish then serving oven-baked with a garlic mayonnaise", "Author": "Good Food", "Ingredients": ["12 mini chorizosausages (for cooking chorizo cut into 12 pieces)", "12 raw shelled prawns", "1 tsp harissa", "½ garlic clove, crushed", "2½ tbsp mayonnaise", "2½ tbsp Greek yogurt", "1 tbsp chopped parsley"], "Method": ["Heat oven to 200C/180C fan/gas 6 and cook the chorizo on a tray for 12 mins. Meanwhile, mix together the prawns and harissa. In a bowl, combine the garlic, mayo and yogurt to make a dip.", "Turn the chorizo, add the prawns to the tray and cook for 3 mins more. Sprinkle the parsley over the prawns, then thread each onto a skewer, followed by a sausage. Serve with the dip."]},
{"Name": "Smoked salmon rice salad", "url": "https://www.bbcgoodfood.com/recipes/smoked-salmon-rice-salad", "Description": "Have some leftover smoked fish on your hands? Create this light and fresh Asian-style salad with a chilli and sesame dressing", "Author": "Katy Greenwood", "Ingredients": ["500g cooked rice, cooled (about 300g uncooked rice)", "bunch spring onion, sliced", "½ cucumber, deseeded and sliced", "small bag rocketleaves", "large handful leftover smoked salmon(about 75g)", "2 tbsp rice vinegar", "2 tbsp sesame oil", "zest and juice 1 lemon", "1 tsp chilli sauce(optional), we used sriracha", "½ tsp sugar"], "Method": ["Whisk the dressing ingredients and set aside. Toss together the salad ingredients in a large bowl with the dressing. Serve from the bowl or pile onto a serving platter."]},
{"Name": "Freeze-ahead chocolate & chestnut parfait", "url": "https://www.bbcgoodfood.com/recipes/freeze-ahead-chocolate-chestnut-parfait", "Description": "This make-ahead festive dessert is deliciously different and incredibly simple to make, with amaretti biscuits, fresh oranges and double cream", "Author": "Jenny White", "Ingredients": ["200g milk chocolate, melted and cooled", "2 x 250g cans sweetened chestnut purée", "100g soft amaretti biscuits, roughly crumbled", "2 oranges, peeled,, segmented and roughly chopped, plus zest 1 orange", "450ml double cream, softly whipped", "50g dark chocolate, coarsely grated, to decorate"], "Method": ["Rinse a 22 x 10 x 7cm deep loaf tin (about 1.5 litres in volume) with cold water, but don’t dry it. Line the tin with cling film, smoothing out as many of the wrinkles as you can.", "Stir the chocolate, chestnut purée and amaretti biscuits together, then stir through the orange and zest. Gently fold in the cream until combined, then spoon the mixture into the tin. Smooth the top and cover with cling film. Freeze for 3-4 hrs until just firm.", "Take the parfait out of the freezer 20 mins before serving. To serve, dip the tin briefly in hot water, then turn out onto a serving plate and remove the cling film. Scatter over the grated chocolate and slice."]},
{"Name": "Cheese with pickled pear salad", "url": "https://www.bbcgoodfood.com/recipes/995636/cheese-with-pickled-pear-salad", "Description": "A contemporary alternative to the traditional cheeseboard, the hardest part will be selecting your favourite cheeses", "Author": "Good Food", "Ingredients": ["1 tsp Dijon mustard", "2½ tbsp white wine vinegar", "2 tbsp olive oil", "1 tbsp walnut oil", "1 tsp yellow mustard seeds", "1 tbsp tarragon, finely chopped", "1 spring onion, thinly sliced", "4 Conference pears, peeled, cored and thinly sliced", "8 thin wedges British cheddaror similar", "8 thin wedges stiltonsor another British cheese", "biscuits, crackers and whole walnuts, to serve"], "Method": ["In a large bowl, mix the mustard and vinegar. Add the oils, mustard seeds, tarragon, spring onion and salt and pepper. Add the pears to the dressing, toss well, then cover and chill for up to 4 hrs until ready to serve. Place a wedge of each cheese on small serving plates, then divide the pear salad between the plates. Serve with biscuits, crackers and walnuts."]},
{"Name": "Root vegetable & mustard mash", "url": "https://www.bbcgoodfood.com/recipes/1799634/root-vegetable-and-mustard-mash", "Description": "Make the most of cheap and tasty seasonal root vegetables in this low fat and super healthy side", "Author": "Good Food", "Ingredients": ["2kg mixed root vegetable, cut into small chunks, we used 1 swede, 1 celeriac and 6 carrots", "50g butter", "3 tbsp extra-virgin olive oil", "2 tbsp wholegrain mustard"], "Method": ["Put the veg in a large pan of salted water. Bring to the boil and cook for 15 mins until tender. Drain well, then mash adding the butter, oil and mustard. Season generously. Mix together until the butter has melted, and serve piping hot. This can be made a day ahead and reheated in the pan with a touch more butter, or in the microwave."]},
{"Name": "Crunchy crab parcels", "url": "https://www.bbcgoodfood.com/recipes/12546/crunchy-crab-parcels", "Description": "The combination of crispy filo pastry & crabmeat makes this a wonderfully indulgent dish", "Author": "John Torode", "Ingredients": ["1 small potato, cut into quarters", "85g butter", "50ml single cream", "2 spring onions, plus extra for serving", "300g mixed white and brown crabmeat", "12 sheets filo pastry"], "Method": ["Boil the potato for 15 mins until soft. Meanwhile, place 25g of the butter and all of the cream in a heavy-based pan and bring to the boil. Slice the spring onions, separating the green and white parts, then add the white slices to the boiling liquid and cook for 1-2 mins to soften. Pass the cooked potato through a ricer or sieve to a really fine mash, then add to the pan and mix everything together. Set aside to cool.", "Add the crabmeat and sliced green bits of spring onion to the potato mixture and stir together. Melt the remaining butter. Unwrap the filo pastry and cover with a clean, damp tea towel to prevent it drying out. Brush melted butter over one sheet, place another on top and brush again with butter. Then add a final sheet of filo.", "Cut the filo sheets lengthways into 3 long strips. Then cut each strip in half across the middle. Place a teaspoon of the crab onto the bottom right-hand corner of each filo strip. Fold the filo over to make a triangle, then fold again, rolling up the strip. When the mixture is enclosed and you have a neat triangle shape, place on a baking sheet and brush with more butter. Can be made ahead up to this point and frozen for up to 1 month.", "Heat oven to 200C/fan 180C/gas 6. Cook the rolls for 15-20 mins until golden and crisp. To serve, pile the parcels up on a plate or bowl, then scatter over with extra sliced spring onion, if you like."]},
{"Name": "Chipolatas wrapped in sage & pancetta", "url": "https://www.bbcgoodfood.com/recipes/2743670/chipolatas-wrapped-in-sage-and-pancetta", "Description": "Update festive favourite trimming pigs-in-blankets by covering sausages in Italian bacon and herb", "Author": "Good Food", "Ingredients": ["24 slices pancetta", "24 whole sageleaves", "24 chipolatasausages"], "Method": ["Heat oven to 220C/200C fan/gas 7. Put 1 slice of pancetta on a chopping board and stretch out using the back of a knife. Put 1 sage leaf and 1 sausage on top, and roll the sausage up on the diagonal, covering all of it. Put on a lightly greased baking sheet and repeat with the remaining sausages. ", " Cook for 20-25 mins until crisp and cooked through."]},
{"Name": "Bay, popcorn & cranberry strings", "url": "https://www.bbcgoodfood.com/recipes/1840653/bay-popcorn-and-cranberry-strings", "Description": "These thrifty decorations look pretty and seasonal - but don't eat them! Great for making with older kids", "Author": "Good Food", "Ingredients": ["30 bay leaves", "100g popcorn", "15-20 whole fresh cranberries"], "Method": ["Cut a 3m length of kitchen string and tie a fat knot 10cm from one end. Thread the other end onto a big, blunt needle, such as a tapestry needle. Thread on bay leaves, popcorn and cranberries, in a random pattern. Tie off when you get to the other end, leaving enough string to hang it up with."]},
{"Name": "Rabbit & pork terrine with peppercorns", "url": "https://www.bbcgoodfood.com/recipes/rabbit-pork-terrine-peppercorns", "Description": "This rich terrine, with thyme, allspice and brandy, can be pressed and mature overnight for a perfect make-ahead starter or light lunch", "Author": "Jane Hornby", "Ingredients": ["meat from 3 wild rabbits, 500g brown meat from the back legs and trimmings, 200g from the loins", "500g boneless pork belly, cut into chunks", "25g butter", "2 garlic cloves, bruised", "3 shallots, finely chopped", "a few thyme sprigs", "good pinch of ground allspice", "1 tbsp green peppercornsin brine, drained", "3-4 tbsp brandy", "splash of vegetable oil", "16-20 rashers dry-cured streaky unsmoked bacon", "about 100g/4oz small cornichons, plus extra to serve"], "Method": ["Ask your butcher to remove the meat from the rabbit, or do it yourself. The leg meat can be as roughly prepped as you like, but keep the loins as neat as you can.", "Put the leg meat, trimmings and pork belly in a processor, finely chop, then tip into a large bowl. Melt the butter and cook the garlic, shallots and thyme together gently for 8 mins or until the shallots are soft but not coloured. Tip onto the minced meat, add the allspice, peppercorns and 3 tbsp brandy, then mix well. Leave to mingle for 1 hr, or longer if you like, in the fridge.", "Add the oil to the pan and quickly brown the loins; you don’t need to cook them through. If you fancy, add 1 tbsp brandy to the pan and flambé them to finish. Set aside on a plate and tip any pan juices into the minced mixture.", "Heat oven to 160C/140C fan/gas 3. Remove the garlic from the mince and season generously. It’s a good idea to fry a small ball of the mixture, let it cool, then taste to check the seasoning. Line a 900g loaf tin with a strip of foil. Stretch each piece of bacon a little with your knife. Arrange the rashers so that the base of the tin is covered with overlapping bacon and the rashers come neatly up the sides in a single layer and overhang generously. Boil a kettleful of water.", "Press a third of the mince into the tin. Make a lengthways channel along one side, then poke in a line of loin pieces, so that they meet end-to-end. Scatter half the cornichons over the other side. Add the next third of mince and repeat, this time with the loins and cornichons on the opposite sides. Cover with the remaining mince, then bring the bacon over to seal. Wrap tightly in foil and put in a deep roasting tin. Pour in enough hot water to come halfway up the terrine and bake for 2 hrs or until a skewer comes out hot from the middle of the terrine, and the juices run clear. Top up the water if needed.", "To press the terrine, sit the loaf tin on a rack in a roasting tin. Tear some cardboard to fit the top of the loaf tin as neatly as you can (we used egg box lids). Add a few layers and sit something extremely heavy on top to press the cardboard and terrine down (we used a cast-iron dish). Cool to room temperature, then chill completely, ideally overnight. Remove the weight and re-wrap the terrine in clean foil or cling film. Ideally, let it mature for 2 days in the fridge before eating. Serve with the pickle salad, below, and remaining cornichons."]},
{"Name": "Chicken terrine with leeks & apricots", "url": "https://www.bbcgoodfood.com/recipes/chicken-terrine-leeks-apricots", "Description": null, "Author": "Jane Hornby", "Ingredients": ["1kg chicken thighson the bone, skin removed", "500ml fresh chicken stock(you can buy this ready-made)", "2 bay leaves, plus more to decorate", "handful thyme sprigs", "handful parsley", "2 leeks, finely chopped (keep the trimmings)", "6 black peppercorns", "30g butter, plus more for the tin", "1 large or 2 smaller banana shallots, finely chopped", "50g smoked streaky baconor pancetta, finely chopped", "1 large garlic clove, finely chopped", "2 chicken breasts, on the bone if possible, skin removed", "50g soft dried apricots, chopped", "3 tbsp brandy", "4 sheets leaf gelatine", "toastdrizzled with olive oil, to serve (we used Crosta & Mollica Pane Pugliese)"], "Method": ["Put the chicken thighs into a pan with the stock and a string-tied bundle of 2 bay leaves, a few of the thyme sprigs and a little of the parsley. Add a few leek trimmings, the peppercorns and ½ tsp salt. Add water to just cover the meat, if needed. Bring to the boil, then cover and gently simmer for 30 mins.", "Meanwhile, lightly butter a 900g loaf tin (ours was 12cm x 22cm x 7cm) and line with cling film, leaving plenty of overhang. Melt the butter in a ", ", then add the leeks, shallots and some seasoning. Cook for 10 mins over a medium heat until starting to colour. Add the bacon and garlic and cook for 2 mins more until the bacon is cooked through. Leave to cool.", "Add the chicken breast to the stock mixture and top up with hot water to cover. Bring to the boil, then cover and simmer gently for another 20 mins. When ready, the chicken breast will be cooked through and the thigh meat will pull away easily from the bones. Lift the meat from the pan, drain the stock and leave to cool until it is just warm.", "Discard the bones and any knobbly bits, then roughly chop the chicken. Stir into the leek mixture, along with 2 tsp more thyme leaves, the apricots and the brandy.", "Soak the gelatine in cold water for 5 mins until floppy. Squeeze out the excess water, stir into 300ml of the warm stock, then mix with the chicken. Put a few bay leaves in the base of the tin, then spoon the chicken mixture on top and press down well. Cover with the cling film. Leave to cool, then chill thoroughly – overnight is best. ", "To serve, slice the terrine while it's still wrapped in cling film, then carefully peel the cling film off each slice. Drizzle the toast slices with olive oil and grill until golden brown and crisp, then sprinkle with a little salt. Serve the terrine with the toast and our yogurt piccalilli & crisp kale salad."]},
{"Name": "Red potatoes with horseradish & crème fraîche", "url": "https://www.bbcgoodfood.com/recipes/1805638/red-potatoes-with-horseradish-and-crme-frache", "Description": "An ideal side for ham, this salad gets added kick from the horseradish and vinegar", "Author": "Good Food", "Ingredients": ["1.8kg baby red or new potato", "4 tbsp white wine vinegar", "bunch spring onions, thinly sliced", "5 tbsp creamed horseradish", "500g crème fraîche", "zest 1 lemon", "bunch chives, chopped"], "Method": ["Cook the potatoes in a large saucepan of boiling salted water until tender. Drain, then place back in the warm pan to dry out a little.", "Pour the vinegar over the potatoes and add a few pinches of salt. Let sit for 10 mins to cool, then add the remaining ingredients and toss gently. Taste and add a little more salt if necessary, then pour into a serving dish."]},
{"Name": "Lettuce, chicory & apple salad with poppy seed dressing", "url": "https://www.bbcgoodfood.com/recipes/1805637/lettuce-chicory-and-apple-salad-with-poppy-seed-dr", "Description": "Make the dressing for this super healthy salad in a jar and keep leftovers in the fridge for during the week", "Author": "Good Food", "Ingredients": ["200g bag mixed crispy salad leaves", "2 heads purple or white chicory, trimmed and separated into leaves", "2 Delicious apples, cored and sliced", "100g toasted walnut, roughly chopped", "150g cherry tomato, halved", "5 tbsp vegetable oil", "5 tbsp honey", "5 tbsp lemon juice", "1 small shallot, finely chopped", "1 heaped tbsp Dijon mustard", "1 tsp poppy seed"], "Method": ["Arrange the salad ingredients on a large platter or big salad bowl. Pour the dressing ingredients into a glass jar with a fitted lid, add some seasoning and shake well. When ready to serve, pour the dressing over and toss everything together."]},
{"Name": "Roasted beetroot & goat's cheese salad", "url": "https://www.bbcgoodfood.com/recipes/roasted-beetroot-and-goats-cheese-salad", "Description": "A simple salad that makes a great starter or light lunch", "Author": "Good Food", "Ingredients": ["2 tbsp olive oil", "1 tbsp balsamic vinegar", "1 tbsp honey", "1 tbsp wholegrain mustard", "500g cooked beetroot, cut into wedges", "100g soft goat's cheese, crumbled", "50g walnut, roughly chopped"], "Method": ["Heat oven to 200C/180C fan/gas 6. Mix the oil, vinegar, honey and mustard in a bowl. Add the beetroot and toss to coat. Spread out on a baking tray and roast for 20 mins until heated through.", "Put the beetroot on a serving platter and sprinkle with the cheese and walnuts. Drizzle with any remaining dressing and serve warm."]},
{"Name": "Roasted squash & lentil salad", "url": "https://www.bbcgoodfood.com/recipes/roasted-squash-and-lentil-salad", "Description": "A healthy, filling salad that makes a great lunch or light supper", "Author": "Good Food", "Ingredients": ["1 butternut squash, peeled and cut into wedges", "2 tbsp olive oil", "1 tsp cumin seeds", "200g cooked puy lentil", "100g feta cheese, crumbled", "50g pumpkin seed"], "Method": ["Heat oven to 200C/180C fan/gas 6. Toss the squash with the oil and cumin seeds, then roast for 30-35 mins until tender and golden. Leave to cool slightly.", "Mix the lentils with the feta and pumpkin seeds, then toss with the squash. Serve warm or at room temperature."]},
{"Name": "Ginger & sesame sprouts", "url": "https://www.bbcgoodfood.com/recipes/2751665/ginger-and-sesame-sprouts", "Description": "Try out this new side dish, which adds fresh and light Asian flavours to traditional winter favourite, Brussels sprouts", "Author": "Good Food", "Ingredients": ["800g Brussels sprout, trimmed and halved", "1 tbsp sesame oil", "small piece ginger, shredded", "4 tbsp toasted sesame seed"], "Method": ["Blanch the sprouts in boiling water and drain well. Heat most of the oil in a wok and add the ginger. Sizzle for a moment, then add the sprouts and stir-fry until hot. Scatter over the sesame seeds and drizzle with a touch more oil. Season with salt, if you like, and serve."]}
]